# -*- encoding: utf-8 -*-
require "ruscountrylist/version"
require 'ruscountrylist/railtie' if defined?(Rails)

module Ruscountrylist 
  RUS_COUNTRIES = ["Абхазия", "Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Американское Самоа",\
     "Ангилья", "Ангола", "Андорра", "Антарктида", "Антигуа и Барбуда", "Аргентина", "Армения", "Аруба", \
     "Афганистан", "Багамы", "Бангладеш", "Барбадос", "Бахрейн", "Беларусь", "Белиз", "Бельгия", "Бенин", \
     "Бермуды", "Болгария", "Боливия, Многонациональное Государство", "Бонайре, Саба и Синт-Эстатиус", \
     "Босния и Герцеговина", "Ботсвана", "Бразилия", "Британская территория в Индийском океане", \
     "Бруней-Даруссалам", "Буркина-Фасо", "Бурунди", "Бутан", "Вануату", "Венгрия", \
     "Венесуэла Боливарианская Республика", "Виргинские острова, Британские", "Виргинские острова, США", \
     "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гваделупа", "Гватемала", "Гвинея", "Гвинея-Бисау", \
     "Германия", "Гернси", "Гибралтар", "Гондурас", "Гонконг", "Гренада", "Гренландия", "Греция", "Грузия", \
     "Гуам", "Дания", "Джерси", "Джибути", "Доминика", "Доминиканская Республика", "Египет", "Замбия", "Западная Сахара", \
     "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран, Исламская Республика", "Ирландия", \
     "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", \
     "Кения", "Кипр", "Киргизия", "Кирибати", "Китай", "Кокосовые (Килинг) острова", "Колумбия", "Коморы", "Конго", \
     "Конго, Демократическая Республика", "Корея, Народно-Демократическая Республика", "Корея, Республика", "Коста-Рика", \
     "Кот д'Ивуар", "Куба", "Кувейт", "Кюрасао", "Лаос", "Латвия", "Лесото", "Ливан", "Ливийская Арабская Джамахирия", \
     "Либерия", "Лихтенштейн", "Литва", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Майотта", "Макао", "Малави", \
     "Малайзия", "Мали", "Малые Тихоокеанские отдаленные острова Соединенных Штатов", "Мальдивы", "Мальта", "Марокко", \
     "Мартиника", "Маршалловы острова", "Мексика", "Микронезия, Федеративные Штаты", "Мозамбик", "Молдова, Республика", \
     "Монако", "Монголия", "Монтсеррат", "Мьянма", "Намибия", "Науру", "Непал", "Нигер", "Нигерия", "Нидерланды", "Никарагуа", \
     "Ниуэ", "Новая Зеландия", "Новая Каледония", "Норвегия", "Объединенные Арабские Эмираты", "Оман", "Остров Буве", \
     "Остров Мэн", "Остров Норфолк", "Остров Рождества", "Остров Херд и острова Макдональд", "Острова Кайман", "Острова Кука", \
     "Острова Теркс и Кайкос", "Пакистан", "Палау", "Палестинская территория, оккупированная", "Панама", \
     "Папский Престол (Государство - город Ватикан)", "Папуа-Новая Гвинея", "Парагвай", "Перу", "Питкерн", \
     "Польша", "Португалия", "Пуэрто-Рико", "Республика Македония", "Реюньон", "Россия", "Руанда", "Румыния", \
     "Самоа", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Святая Елена, Остров вознесения, Тристан-да-Кунья", \
     "Северные Марианские острова", "Сен-Бартельми", "Сен-Мартен", "Сенегал", "Сент-Винсент и Гренадины", \
     "Сент-Китс и Невис", "Сент-Люсия", "Сент-Пьер и Микелон", "Сербия", "Сейшелы", "Сингапур", "Синт-Мартен", \
     "Сирийская Арабская Республика", "Словакия", "Словения", "Соединенное Королевство", "Соединенные Штаты", \
     "Соломоновы острова", "Сомали", "Судан", "Суринам", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань (Китай)", \
     "Танзания, Объединенная Республика", "Тимор-Лесте", "Того", "Токелау", "Тонга", "Тринидад и Тобаго", "Тувалу", \
     "Тунис", "Туркмения", "Турция", "Уганда", "Узбекистан", "Украина", "Уоллис и Футуна", "Уругвай", "Фарерские острова", \
     "Фиджи", "Филиппины", "Финляндия", "Фолклендские острова (Мальвинские)", "Франция", "Французская Гвиана", \
     "Французская Полинезия", "Французские Южные территории", "Хорватия", "Центрально-Африканская Республика", "Чад", \
     "Черногория", "Чешская Республика", "Чили", "Швейцария", "Швеция", "Шпицберген и Ян Майен", "Шри-Ланка", "Эквадор", \
     "Экваториальная Гвинея", "Эландские острова", "Эль-Сальвадор", "Эритрея", "Эстония", "Эфиопия", "Южная Африка", \
     "Южная Джорджия и Южные Сандвичевы острова", "Южная Осетия", "Южный Судан", "Ямайка", "Япония"] unless const_defined?("RUS_COUNTRIES")
end

begin
  require 'rails'
rescue LoadError
  #do nothing
end

